brew "act"
brew "git"
brew "gitleaks"
brew "go"
brew "helm"
brew "jq"
brew "k9s"
brew "lazygit"
brew "minikube"
brew "navi"
brew "pipx"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"
cask "font-meslo-for-powerline"
cask "font-monaspace"
cask "orbstack"
vscode "docker.docker"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "meezilla.json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "zhuangtongfa.material-theme"
