tap "nikitabobko/tap"
# Run your GitHub Actions locally
brew "act"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go version management
brew "goenv"
# Kubernetes package manager
brew "helm"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Anthropic's official Claude AI desktop app
cask "claude"
cask "font-meslo-for-powerline"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "miniconda"
vscode-language-pack-zh-hant "slack"
cask "heptabase"
cask "discord"
cask "raycast"
cask "spotify"
cask "orbstack"
cask "anki"
cask "google-chrome"
cask "obsidian"
cask "notion"
cask "karabiner-elements"
cask "logi-options+"
cask "obs"
cask "Postmano"
cask "visual-studio-code"
# Replacement for Docker Desktop
cask "orbstack"
mas "Barbee", id: 1548711022
mas "Be Focused", id: 973134470
mas "Bitwarden", id: 1352778147
mas "Goodnotes", id: 1444383602
mas "LINE", id: 539883307
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "RunCat", id: 1429033973
mas "Xcode", id: 497799835
vscode "docker.docker"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "meezilla.json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "nomicfoundation.hardhat-solidity"
vscode "zhuangtongfa.material-theme"
